In [1]:
import pandas as pd
import numpy as np

In [3]:
fortune = pd.read_csv('../data/fortune_500_2017.csv',
                     usecols=['Rank', 'Title', 'Employees', 'Profits', 'Assets'],
                     index_col='Rank')
fortune.head()

                   Title  Employees  Profits  Assets
Rank
1                Walmart    2300000  13643.0  198825
2     Berkshire Hathaway     367700  24074.0  620854
3                  Apple     116000  45687.0  321686
4            Exxon Mobil      72700   7840.0  330314
5               McKesson      68000   2258.0   56563

In [4]:
fortune['Employees'].rank(ascending=False).head()

Rank
1      1.0
2      7.0
3     57.0
4     94.0
5    104.5
Name: Employees, dtype: float64

In [5]:
fortune['RankByEmployee'] = fortune['Employees'].rank(ascending=False)
fortune.head()

                   Title  Employees  Profits  Assets  RankByEmployee
Rank
1                Walmart    2300000  13643.0  198825             1.0
2     Berkshire Hathaway     367700  24074.0  620854             7.0
3                  Apple     116000  45687.0  321686            57.0
4            Exxon Mobil      72700   7840.0  330314            94.0
5               McKesson      68000   2258.0   56563           104.5

In [6]:
fortune['Profits'].rank(ascending=False).head()

Rank
1     11.0
2      3.0
3      1.0
4     27.0
5    102.0
Name: Profits, dtype: float64

In [7]:
fortune['RankByProfits'] = fortune['Profits'].rank(ascending=False).head()
fortune.head()

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
1,Walmart,2300000,13643.0,198825,1.0,11.0
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0
3,Apple,116000,45687.0,321686,57.0,1.0
4,Exxon Mobil,72700,7840.0,330314,94.0,27.0
5,McKesson,68000,2258.0,56563,104.5,102.0

### Top 10 employees rank

In [8]:
isEmployessRankFirst10 = fortune['RankByEmployee'] <= 10

### Top 10 profits rank

In [9]:
isProfitRankFirst10 = fortune['RankByProfits'] <= 10

In [10]:
fortune[isEmployessRankFirst10 & isProfitRankFirst10]

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0

### Companies with lowest number of employees

In [22]:
isEmployeesRankMore400 = fortune['RankByEmployee'] >= 400

In [23]:
fortune[isEmployeesRankMore400 & isProfitRankFirst10]

Empty DataFrame
Columns: [Title, Employees, Profits, Assets, RankByEmployee, RankByProfits]
Index: []

### Conlusion: We can assume that there is no correlation between profits and number of employees.